In [33]:
import pandas as pd
import matplotlib.pyplot as plt
from pandas import ExcelWriter
from pandas import ExcelFile
import sqlalchemy
import sqlite3 as sq

In [34]:
user = 'cvkuzmyutihdti'
password = 'ccb658b9dbaa9f02508c213880d12db3c0025e92aea837baa7f5f11f60a073e0'
port = '5432'
database = 'd7drrt22cf3tcf'
host = 'ec2-23-21-91-183.compute-1.amazonaws.com'

url = 'postgres://'+user+':'+password+'@'+host+':'+port+'/'+database

engine = sqlalchemy.create_engine(url) # connect to server
con = engine.connect()

In [63]:
# file = 'Global_Energy_Project/Data/EnergyCSV/CO2 emissions from fuel combus.csv'
file = 'CO2_emissions_from_fuel_combus.csv'
# file = 'winemag-data-short.csv'

In [64]:
df = pd.read_csv(file)

In [70]:
df.head()

,Unnamed: 0,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,World,20277.70,20428.88,20389.24,20483.38,20569.16,21057.10,21556.95,21792.24,21921.24,...,28580.22,28253.70,29824.65,30672.31,31062.29,31593.72,31775.87,31740.50,31986.76,32667.39
1,OECD,11174.87,11205.76,11267.76,11357.11,11540.20,11688.90,12090.85,12242.76,12250.75,...,12848.22,12080.12,12594.55,12429.28,12317.26,12313.68,12125.64,12006.28,12032.69,12194.92
2,G7,8575.88,8549.52,8599.21,8665.63,8776.88,8872.86,9131.32,9235.16,9275.72,...,9370.59,8720.45,9092.64,8917.68,8823.71,8897.20,8785.76,8588.68,8548.13,8605.36
3,BRICS,5411.20,5573.58,5544.03,5584.72,5532.00,5784.36,5836.73,5819.56,5924.93,...,10419.12,10908.42,11701.95,12583.75,12913.56,13365.76,13598.53,13651.28,13732.63,14105.30
4,Europe,4417.64,4392.06,4270.49,4181.88,4135.39,4191.75,4349.96,4274.10,4281.23,...,4345.78,4033.70,4174.56,4050.41,4025.40,3927.59,3759.79,3817.02,3836.71,3949.88

In [73]:
df = df.transpose()

In [76]:
df = df.reset_index()

In [77]:
df.head()

,index,0,1,2,3,4,5,6,7,8,...,48,49,50,51,52,53,54,55,56,57
0,Unnamed: 0,World,OECD,G7,BRICS,Europe,European Union,Belgium,Czech Rep.,France,...,Africa,Algeria,Egypt,Nigeria,South Africa,Middle-East,Iran,Kuwait,Saudi Arabia,United Arab Emirates
1,1990,20277.7,11174.9,8575.88,5411.2,4417.64,4115.02,105.89,151.25,357.02,...,540.3,52.98,78.5,28.32,253.94,589.22,181.22,28.07,155.69,52.15
2,1991,20428.9,11205.8,8549.52,5573.58,4392.06,4099.76,110.43,139.65,383.18,...,546.73,57.15,77.18,33.59,250,604.04,200.79,7.82,162.06,59.46
3,1992,20389.2,11267.8,8599.21,5544.03,4270.49,3981.31,109.48,134.2,372.34,...,555.68,57.26,80.06,40.14,246.78,676.17,218.15,22.5,176.78,56.91
4,1993,20483.4,11357.1,8665.63,5584.72,4181.88,3896.36,108.16,132.72,354.24,...,566.1,59.2,81.83,36.64,255.05,726.36,219.61,28.8,187.36,59.99

In [75]:
df[1]

Unnamed: 0       OECD
1990          11174.9
1991          11205.8
1992          11267.8
1993          11357.1
1994          11540.2
1995          11688.9
1996          12090.9
1997          12242.8
1998          12250.8
1999          12354.2
2000          12680.8
2001          12665.4
2002          12712.3
2003          12936.4
2004          13048.3
2005          13093.8
2006            13014
2007          13218.5
2008          12848.2
2009          12080.1
2010          12594.5
2011          12429.3
2012          12317.3
2013          12313.7
2014          12125.6
2015          12006.3
2016          12032.7
2017          12194.9
Name: 1, dtype: object

In [54]:
df2.to_sql(name="emissions", con = engine, if_exists = 'replace', index=False)

In [52]:
df2 = df.transpose()

In [53]:
df2.head()

,0,1,2,3,4,5,6,7,8,9,...,48,49,50,51,52,53,54,55,56,57
Country,World,OECD,G7,BRICS,Europe,European Union,Belgium,Czech Rep.,France,Germany,...,Africa,Algeria,Egypt,Nigeria,South Africa,Middle-East,Iran,Kuwait,Saudi Arabia,United Arab Emirates
1990,20277.7,11174.9,8575.88,5411.2,4417.64,4115.02,105.89,151.25,357.02,955.79,...,540.3,52.98,78.5,28.32,253.94,589.22,181.22,28.07,155.69,52.15
1991,20428.9,11205.8,8549.52,5573.58,4392.06,4099.76,110.43,139.65,383.18,938.81,...,546.73,57.15,77.18,33.59,250,604.04,200.79,7.82,162.06,59.46
1992,20389.2,11267.8,8599.21,5544.03,4270.49,3981.31,109.48,134.2,372.34,899.6,...,555.68,57.26,80.06,40.14,246.78,676.17,218.15,22.5,176.78,56.91
1993,20483.4,11357.1,8665.63,5584.72,4181.88,3896.36,108.16,132.72,354.24,889.54,...,566.1,59.2,81.83,36.64,255.05,726.36,219.61,28.8,187.36,59.99

In [12]:
consumption_df = pd.read_excel(file, sheet_name='T34 Wine consumption vol', skiprows=0) # 1st row is sheet title, 2nd is column header

In [36]:
consumption_df.head()

,year,France,Italy,Portugal,Spain,Austria,Norway,Belgium,Denmark,Finland,...,India,Japan,Korea,Malaysia,Philippines,Singapore,Taiwan,Thailand,World,Unnamed: 54
0,1865,5.464817e+06,2.193162e+06,-1.000000,1342526.774,166088.593333,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1,1.128784e+07,-1
1,1866,5.841136e+06,2.322928e+06,163936.586667,1384769.064,171990.526667,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1,1.190562e+07,-1
2,1867,5.534552e+06,2.311145e+06,168256.960000,1422090.855,157647.360000,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1,1.183056e+07,-1
3,1868,4.966427e+06,2.281722e+06,154492.270000,1421536.515,150970.917778,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1,1.160797e+07,-1
4,1869,5.146019e+06,2.440358e+06,139992.746667,1519760.902,133839.531111,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1,1.194991e+07,-1

In [32]:
test = consumption_df.set_index('year')

In [37]:
test = consumption_df.transpose()

In [38]:
test.head()

,0,1,2,3,4,5,6,7,8,9,...,142,143,144,145,146,147,148,149,150,151
year,1.865000e+03,1.866000e+03,1.867000e+03,1.868000e+03,1.869000e+03,1.870000e+03,1.871000e+03,1.872000e+03,1.873000e+03,1.874000e+03,...,2.007000e+03,2.008000e+03,2.009000e+03,2.010000e+03,2.011000e+03,2.012000e+03,2.013000e+03,2.014000e+03,2015.0,2016.0
France,5.464817e+06,5.841136e+06,5.534552e+06,4.966427e+06,5.146019e+06,5.657965e+06,5.820113e+06,5.218458e+06,4.571483e+06,4.872567e+06,...,3.029891e+06,2.916934e+06,2.933079e+06,2.916250e+06,3.063215e+06,2.988720e+06,2.914485e+06,2.786903e+06,2720000.0,2700000.0
Italy,2.193162e+06,2.322928e+06,2.311145e+06,2.281722e+06,2.440358e+06,2.586237e+06,2.617610e+06,2.670320e+06,2.244687e+06,2.062981e+06,...,2.380643e+06,2.252047e+06,1.993957e+06,1.889990e+06,1.893799e+06,2.130703e+06,2.087168e+06,1.950000e+06,2140000.0,2250000.0
Portugal,-1.000000e+00,1.639366e+05,1.682570e+05,1.544923e+05,1.399927e+05,1.815664e+05,1.914920e+05,1.766686e+05,1.760411e+05,1.624217e+05,...,5.483129e+05,5.493051e+05,5.459651e+05,5.613930e+05,5.586592e+05,5.897495e+05,4.483809e+05,4.453508e+05,-1.0,-1.0
Spain,1.342527e+06,1.384769e+06,1.422091e+06,1.421537e+06,1.519761e+06,1.541888e+06,1.559374e+06,1.568042e+06,1.553642e+06,1.660237e+06,...,7.383240e+05,6.434189e+05,6.031119e+05,6.530166e+05,7.107870e+05,7.136949e+05,6.851356e+05,7.000000e+05,-1.0,-1.0

In [18]:
consumption_df = pd.read_excel(file, sheet_name='T34 Wine consumption vol', skiprows=0) # 1st row is sheet title, 2nd is column header

production_df = pd.read_excel(file, sheet_name='T6 Wine production', skiprows=0) # 1st row is sheet title, 2nd is column header

population_df = pd.read_excel(file, sheet_name='T58 Population', skiprows=0) # 1st row is sheet title, 2nd is column header

In [40]:
consumption_df.head()

,year,France,Italy,Portugal,Spain,Austria,Norway,Belgium,Denmark,Finland,...,India,Japan,Korea,Malaysia,Philippines,Singapore,Taiwan,Thailand,World,Unnamed: 54
0,1865,5.464817e+06,2.193162e+06,-1.000000,1342526.774,166088.593333,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1,1.128784e+07,-1
1,1866,5.841136e+06,2.322928e+06,163936.586667,1384769.064,171990.526667,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1,1.190562e+07,-1
2,1867,5.534552e+06,2.311145e+06,168256.960000,1422090.855,157647.360000,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1,1.183056e+07,-1
3,1868,4.966427e+06,2.281722e+06,154492.270000,1421536.515,150970.917778,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1,1.160797e+07,-1
4,1869,5.146019e+06,2.440358e+06,139992.746667,1519760.902,133839.531111,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1.0,-1,1.194991e+07,-1

In [20]:
production_df.head()

,year,France,Italy,Portugal,Spain,Austria,Belgium,Denmark,Finland,Germany,...,India,Japan,Korea,Malaysia,Philippines,Singapore,Taiwan,Thailand,World,Unnamed: 54
0,1865,6.946000e+06,1.829807e+06,215100.0,1494356.0,172138.926667,-1.0,-1,-1,165000.0,...,-1.0,700.0,-1,-1,-1,-1,-1,-1,1.267315e+07,-1
1,1866,6.431678e+06,2.173405e+06,215700.0,1548267.0,168054.260000,-1.0,-1,-1,300000.0,...,-1.0,700.0,-1,-1,-1,-1,-1,-1,1.253196e+07,-1
2,1867,3.942146e+06,2.145163e+06,150000.0,1602178.0,163969.593333,-1.0,-1,-1,296000.0,...,-1.0,700.0,-1,-1,-1,-1,-1,-1,1.028657e+07,-1
3,1868,5.248874e+06,2.124539e+06,179700.0,1656089.0,159885.000000,-1.0,-1,-1,444000.0,...,-1.0,700.0,-1,-1,-1,-1,-1,-1,1.200536e+07,-1
4,1869,7.052500e+06,2.284411e+06,187700.0,1710000.0,123090.000000,-1.0,-1,-1,209000.0,...,-1.0,700.0,-1,-1,-1,-1,-1,-1,1.355780e+07,-1

In [21]:
population_df.head()

,year,France,Italy,Portugal,Spain,Austria,Norway,Belgium,Denmark,Finland,...,India,Japan,Korea,Malaysia,Philippines,Singapore,Taiwan,Thailand,World,Unnamed: 54
0,1865,38020.0,26915.0,4201.0,15920.0,4380.0,-1.0,4915.0,1799.0,1833.0,...,248585.830980,33810.880248,9701.0,732.5,4700.25,77.0,2308.75,5638.75,1.233130e+06,-1
1,1866,38080.0,27131.0,4226.0,15976.0,4409.0,-1.0,4950.0,1814.0,1840.0,...,249462.463444,33935.186799,9711.4,746.0,4772.80,78.4,2316.00,5666.00,1.237145e+06,-1
2,1867,38230.0,27381.0,4251.0,16032.0,4439.0,-1.0,4986.0,1833.0,1831.0,...,250342.187333,34059.950367,9721.8,759.5,4845.35,79.8,2323.25,5693.25,1.240118e+06,-1
3,1868,38330.0,27440.0,4276.0,16088.0,4469.0,-1.0,5023.0,1852.0,1776.0,...,251225.013550,34185.172631,9732.2,773.0,4917.90,81.2,2330.50,5720.50,1.243458e+06,-1
4,1869,38890.0,27561.0,4302.0,16144.0,4499.0,-1.0,5029.0,1871.0,1734.0,...,252110.953033,34310.855278,9742.6,786.5,4990.45,82.6,2337.75,5747.75,1.247527e+06,-1

In [20]:
user = 'cvkuzmyutihdti'
password = 'ccb658b9dbaa9f02508c213880d12db3c0025e92aea837baa7f5f11f60a073e0'
port = '5432'
database = 'd7drrt22cf3tcf'
host = 'ec2-23-21-91-183.compute-1.amazonaws.com'

url = 'postgres://'+user+':'+password+'@'+host+':'+port+'/'+database

engine = sqlalchemy.create_engine(url) # connect to server
con = engine.connect()

In [42]:
consumption_df.to_sql(name="consumption_db", con = engine, if_exists = 'replace', index=False)
production_df.to_sql(name="production_db", con = engine, if_exists = 'replace', index=False)
population_df.to_sql(name="population_db", con = engine, if_exists = 'replace', index=False)

In [8]:
## create df from wine reviews file
winemag_df = pd.read_csv('winemag-data-short.csv')
winemag_df.head()

,ID,country,points,price,province,region_1,taster_name,title,variety,winery
0,0,Italy,87,NaN,Sicily & Sardinia,Etna,Kerin O’Keefe,Nicosia 2013 Vulkà Bianco (Etna),White Blend,Nicosia
1,1,Portugal,87,15.0,Douro,NaN,Roger Voss,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,2,US,87,14.0,Oregon,Willamette Valley,Paul Gregutt,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,3,US,87,13.0,Michigan,Lake Michigan Shore,Alexander Peartree,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,4,US,87,65.0,Oregon,Willamette Valley,Paul Gregutt,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks

               ID      points       price
count  151.000000  151.000000  142.000000
mean    75.000000   87.470199   31.288732
std     43.734045    1.965733   22.153744
min      0.000000   85.000000    9.000000
25%     37.500000   86.000000   16.000000
50%     75.000000   87.000000   22.000000
75%    112.500000   88.000000   40.000000
max    150.000000   92.000000  112.000000

In [9]:
# Create table with wine reviews info in heroku postgres
winemag_df.to_sql(name="winemag_db", con = engine, if_exists = 'replace', index=False)

In [44]:
### Create a sqlite file from a dataframe

sql_data = 'wine_db.sqlite' #- Creates DB names SQLite
conn = sq.connect(sql_data)
cur = conn.cursor()
# cur.execute('''DROP TABLE IF EXISTS''')
consumption_df.to_sql('consumption', conn, if_exists='replace', index=True) # - writes the pd.df to SQLIte DB
production_df.to_sql('production', conn, if_exists='replace', index=True)
population_df.to_sql('population', conn, if_exists='replace', index=True)
#pd.read_sql('select * from SentimentAnalysis', conn)
conn.commit()
conn.close()

C:\Users\alaq3\Anaconda3\lib\site-packages\pandas\core\generic.py:2531: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  dtype=dtype, method=method)

In [12]:
### Create a sqlite file from a dataframe

sql_data = 'winemag_short_db.sqlite' #- Creates DB names SQLite
conn = sq.connect(sql_data)
cur = conn.cursor()
# cur.execute('''DROP TABLE IF EXISTS''')
winemag_df.to_sql('winemag_db', conn, if_exists='replace', index=True) # - writes the pd.df to SQLIte DB
# production_df.to_sql('production', conn, if_exists='replace', index=True)
# population_df.to_sql('population', conn, if_exists='replace', index=True)
#pd.read_sql('select * from SentimentAnalysis', conn)
conn.commit()
conn.close()

In [45]:
pwd

'C:\\Users\\alaq3\\OneDrive\\Documents\\GitHub\\test_project_2'